[Killed] BlockStatement
src/calendar.js:2:51
 class Calendar {
-    static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
-            throw new Error("invalid month1");
-        }
-        if (month2 < 1 || month2 > 12) {
-            throw new Error("invalid month2");
-        }
-        if (day1 < 1 || day1 > 31) {
-            throw new Error("invalid day1");
-        }
-        if (day2 < 1 || day2 > 31) {
-            throw new Error("invalid day2");
-        }
-        if (year < 1 || year > 10000) {
-            throw new Error("invalid year");
-        }
-        if (month1 === month2 && day1 > day2) {
-            throw new Error("day1 must be less than day2 if month1 is equal to month2");
-        }
-        if (month1 > month2) {
-            throw new Error("month1 must be less than month2");
-        }
-
-        return this.#calendar(month1, day1, month2, day2, year);
-    }
+    static main(month1, day1, month2, day2, year) {}
 
     static #calendar(month1, day1, month2, day2, year) {
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (7.7206ms)

✖ different days in same month (0.4735ms)

[Killed] BlockStatement
src/calendar.js:3:40
 class Calendar {
     static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
-            throw new Error("invalid month1");
-        }
+        if (month1 < 1 || month1 > 12) {}
         if (month2 < 1 || month2 > 12) {
             throw new Error("invalid month2");
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (16.7966ms)

✔ different days in same month (0.2856ms)
✔ adjacent days across months (0.4329ms)

[Killed] EqualityOperator
src/calendar.js:3:27
 class Calendar {
     static main(month1, day1, month2, day2, year) {
-        if (month1 < 1 || month1 > 12) {
+        if (month1 < 1 || month1 >= 12) {
             throw new Error("invalid month1");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.2153ms)

✔ different days in same month (0.4836ms)
✔ adjacent days across months (0.4585ms)

[Killed] EqualityOperator
src/calendar.js:6:27
         if (month1 < 1 || month1 > 12) {
             throw new Error("invalid month1");
         }
-        if (month2 < 1 || month2 > 12) {
+        if (month2 < 1 || month2 <= 12) {
             throw new Error("invalid month2");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (4.4395ms)

✖ different days in same month (0.281ms)

[Killed] StringLiteral
src/calendar.js:7:29
             throw new Error("invalid month1");
         }
         if (month2 < 1 || month2 > 12) {
-            throw new Error("invalid month2");
+            throw new Error("");
         }
         if (day1 < 1 || day1 > 31) {
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.9477ms)

✔ different days in same month (0.2929ms)
✔ adjacent days across months (0.4388ms)

[Killed] ConditionalExpression
src/calendar.js:9:13
         if (month2 < 1 || month2 > 12) {
             throw new Error("invalid month2");
         }
-        if (day1 < 1 || day1 > 31) {
+        if (true) {
             throw new Error("invalid day1");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (4.3435ms)

✖ different days in same month (0.2748ms)

[Killed] BlockStatement
src/calendar.js:9:36
         if (month2 < 1 || month2 > 12) {
             throw new Error("invalid month2");
         }
-        if (day1 < 1 || day1 > 31) {
-            throw new Error("invalid day1");
-        }
+        if (day1 < 1 || day1 > 31) {}
         if (day2 < 1 || day2 > 31) {
             throw new Error("invalid day2");
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.1945ms)

✔ different days in same month (0.3176ms)

[Killed] StringLiteral
src/calendar.js:13:29
             throw new Error("invalid day1");
         }
         if (day2 < 1 || day2 > 31) {
-            throw new Error("invalid day2");
+            throw new Error("");
         }
         if (year < 1 || year > 10000) {
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.46ms)

✔ different days in same month (0.2962ms)

[Killed] EqualityOperator
src/calendar.js:15:13
         if (day2 < 1 || day2 > 31) {
             throw new Error("invalid day2");
         }
-        if (year < 1 || year > 10000) {
+        if (year >= 1 || year > 10000) {
             throw new Error("invalid year");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (4.6277ms)

✖ different days in same month (0.3042ms)

[Killed] EqualityOperator
src/calendar.js:15:25
         if (day2 < 1 || day2 > 31) {
             throw new Error("invalid day2");
         }
-        if (year < 1 || year > 10000) {
+        if (year < 1 || year <= 10000) {
             throw new Error("invalid year");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (12.6578ms)
✖ different days in same month (0.3179ms)

✖ adjacent days across months (0.268ms)

[Killed] ConditionalExpression
src/calendar.js:18:13
         if (year < 1 || year > 10000) {
             throw new Error("invalid year");
         }
-        if (month1 === month2 && day1 > day2) {
+        if (true && day1 > day2) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (5.542ms)

✔ different days in same month (0.2858ms)

[Killed] ConditionalExpression
src/calendar.js:18:13
         if (year < 1 || year > 10000) {
             throw new Error("invalid year");
         }
-        if (month1 === month2 && day1 > day2) {
+        if (true) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (4.6541ms)

✖ different days in same month (0.3033ms)

[Killed] BlockStatement
src/calendar.js:21:30
         if (month1 === month2 && day1 > day2) {
             throw new Error("day1 must be less than day2 if month1 is equal to month2");
         }
-        if (month1 > month2) {
-            throw new Error("month1 must be less than month2");
-        }
+        if (month1 > month2) {}
 
         return this.#calendar(month1, day1, month2, day2, year);
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.416ms)

✔ different days in same month (0.3129ms)
✔ adjacent days across months (0.4841ms)

[Killed] BlockStatement
src/calendar.js:28:56
         return this.#calendar(month1, day1, month2, day2, year);
     }
 
-    static #calendar(month1, day1, month2, day2, year) {
-        let numDays;
-
-        if (month2 === month1) {
-            numDays = day2 - day1;
-        } else {
-            // ignore 0 index
-            let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
-            if (this.#isLeapYear(year))
-                daysIn[2] = 29;
-            else
-                daysIn[2] = 28;
-
-            numDays = day2 + (daysIn[month1] - day1);
-
-            for (let i = month1 + 1; i <= month2 - 1; i++)
-                numDays += daysIn[i];
-        }
-        return numDays;
-    }
+    static #calendar(month1, day1, month2, day2, year) {}
 
     static #isLeapYear(year) {
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (7.8756ms)
✖ different days in same month (0.6694ms)
✖ adjacent days across months (0.4914ms)
✖ across multiple months with middle months (0.5153ms)

[Killed] BlockStatement
src/calendar.js:31:32
     static #calendar(month1, day1, month2, day2, year) {
         let numDays;
 
-        if (month2 === month1) {
-            numDays = day2 - day1;
-        } else {
+        if (month2 === month1) {} else {
             // ignore 0 index
             let daysIn = [0, 31, 0, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✖ same day in same month returns zero (7.7751ms)

✖ different days in same month (0.6805ms)
✔ adjacent days across months (0.7121ms)

[Killed] EqualityOperator
src/calendar.js:43:38
 
             numDays = day2 + (daysIn[month1] - day1);
 
-            for (let i = month1 + 1; i <= month2 - 1; i++)
+            for (let i = month1 + 1; i < month2 - 1; i++)
                 numDays += daysIn[i];
         }
killedBy: All tests
statusReason: > hw7@1.0.0 test
> node --test


✔ same day in same month returns zero (6.5324ms)

✔ different days in same month (0.3991ms)
✔ adjacent days across months (0.5196ms)
